MikroElektronika/core_packages/RX/gcc/def/renesas/R5F526TBBGFN/mcu.h
typedef struct st_ofsm {
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 17;
			unsigned long OCDE : 1;
			unsigned long  : 6;
			unsigned long IDE : 1;
			unsigned long  : 2;
			unsigned long SPE : 1;
			unsigned long  : 1;
			unsigned long SEPR : 1;
			unsigned long WRPR : 1;
			unsigned long RDPR : 1;
#else
			unsigned long RDPR : 1;
			unsigned long WRPR : 1;
			unsigned long SEPR : 1;
			unsigned long  : 1;
			unsigned long SPE : 1;
			unsigned long  : 2;
			unsigned long IDE : 1;
			unsigned long  : 6;
			unsigned long OCDE : 1;
			unsigned long  : 17;
#endif
	} BIT;
	} SPCC;
	char           wk0[4];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 24;
			unsigned long TMEF : 3;
			unsigned long  : 1;
			unsigned long TMEFDB : 3;
			unsigned long  : 1;
#else
			unsigned long  : 1;
			unsigned long TMEFDB : 3;
			unsigned long  : 1;
			unsigned long TMEF : 3;
			unsigned long  : 24;
#endif
	} BIT;
	} TMEF;
	char           wk1[4];
	union {
		struct {
			unsigned long ID4:8;
			unsigned long ID3:8;
			unsigned long ID2:8;
			unsigned long ID1:8;
			unsigned long ID8:8;
			unsigned long ID7:8;
			unsigned long ID6:8;
			unsigned long ID5:8;
			unsigned long ID12:8;
			unsigned long ID11:8;
			unsigned long ID10:8;
			unsigned long ID9:8;
			unsigned long ID16:8;
			unsigned long ID15:8;
			unsigned long ID14:8;
			unsigned long ID13:8;
		} BIT;
	} OSIS;
	unsigned long  TMINF;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long MDE : 3;
			unsigned long  : 1;
			unsigned long BANKMD : 3;
			unsigned long  : 25;
#else
			unsigned long  : 25;
			unsigned long BANKMD : 3;
			unsigned long  : 1;
			unsigned long MDE : 3;
#endif
	} BIT;
	} MDE;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long  : 1;
			unsigned long IWDTSTRT : 1;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long  : 1;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 2;
			unsigned long WDTSTRT : 1;
			unsigned long WDTTOPS : 2;
			unsigned long WDTCKS : 4;
			unsigned long WDTRPES : 2;
			unsigned long WDTRPSS : 2;
			unsigned long WDTRSTIRQS : 1;
			unsigned long  : 3;
#else
			unsigned long  : 3;
			unsigned long WDTRSTIRQS : 1;
			unsigned long WDTRPSS : 2;
			unsigned long WDTRPES : 2;
			unsigned long WDTCKS : 4;
			unsigned long WDTTOPS : 2;
			unsigned long WDTSTRT : 1;
			unsigned long  : 2;
			unsigned long IWDTSLCSTP : 1;
			unsigned long  : 1;
			unsigned long IWDTRSTIRQS : 1;
			unsigned long IWDTRPSS : 2;
			unsigned long IWDTRPES : 2;
			unsigned long IWDTCKS : 4;
			unsigned long IWDTTOPS : 2;
			unsigned long IWDTSTRT : 1;
			unsigned long  : 1;
#endif
	} BIT;
	} OFS0;
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long VDSEL : 2;
			unsigned long LVDAS : 1;
			unsigned long  : 5;
			unsigned long HOCOEN : 1;
			unsigned long  : 23;
#else
			unsigned long  : 23;
			unsigned long HOCOEN : 1;
			unsigned long  : 5;
			unsigned long LVDAS : 1;
			unsigned long VDSEL : 2;
#endif
	} BIT;
	} OFS1;
	char           wk2[32];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long BANKSWP : 3;
			unsigned long  : 29;
#else
			unsigned long  : 29;
			unsigned long BANKSWP : 3;
#endif
	} BIT;
	} BANKSEL;
	char           wk3[12];
	union {
		unsigned long LONG;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned long FAWS : 13;
			unsigned long  : 2;
			unsigned long FSPR : 1;
			unsigned long FAWE : 13;
			unsigned long  : 2;
			unsigned long BTFLG : 1;
#else
			unsigned long BTFLG : 1;
			unsigned long  : 2;
			unsigned long FAWE : 13;
			unsigned long FSPR : 1;
			unsigned long  : 2;
			unsigned long FAWS : 13;
#endif
	} BIT;
	} FAW;
} st_ofsm_t;

typedef struct st_poe {
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE0M : 4;
			unsigned short POE0M2 : 4;
			unsigned short PIE1 : 1;
			unsigned short  : 3;
			unsigned short POE0F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE0F : 1;
			unsigned short  : 3;
			unsigned short PIE1 : 1;
			unsigned short POE0M2 : 4;
			unsigned short POE0M : 4;
#endif
	} BIT;
	} ICSR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE1 : 1;
			unsigned short OCE1 : 1;
			unsigned short  : 5;
			unsigned short OSF1 : 1;
#else
			unsigned short OSF1 : 1;
			unsigned short  : 5;
			unsigned short OCE1 : 1;
			unsigned short OIE1 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE4M : 4;
			unsigned short POE4M2 : 4;
			unsigned short PIE2 : 1;
			unsigned short  : 3;
			unsigned short POE4F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE4F : 1;
			unsigned short  : 3;
			unsigned short PIE2 : 1;
			unsigned short POE4M2 : 4;
			unsigned short POE4M : 4;
#endif
	} BIT;
	} ICSR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE2 : 1;
			unsigned short OCE2 : 1;
			unsigned short  : 5;
			unsigned short OSF2 : 1;
#else
			unsigned short OSF2 : 1;
			unsigned short  : 5;
			unsigned short OCE2 : 1;
			unsigned short OIE2 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE8M : 4;
			unsigned short POE8M2 : 4;
			unsigned short PIE3 : 1;
			unsigned short POE8E : 1;
			unsigned short  : 2;
			unsigned short POE8F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE8F : 1;
			unsigned short  : 2;
			unsigned short POE8E : 1;
			unsigned short PIE3 : 1;
			unsigned short POE8M2 : 4;
			unsigned short POE8M : 4;
#endif
	} BIT;
	} ICSR3;
	char           wk0[1];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char MTU0AZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0DZE : 1;
			unsigned char  : 4;
#else
			unsigned char  : 4;
			unsigned char MTU0DZE : 1;
			unsigned char MTU0CZE : 1;
			unsigned char MTU0BZE : 1;
			unsigned char MTU0AZE : 1;
#endif
	} BIT;
	} POECR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU7BDZE : 1;
			unsigned short MTU7ACZE : 1;
			unsigned short MTU6BDZE : 1;
			unsigned short  : 5;
			unsigned short MTU4BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU3BDZE : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short MTU3BDZE : 1;
			unsigned short MTU4ACZE : 1;
			unsigned short MTU4BDZE : 1;
			unsigned short  : 5;
			unsigned short MTU6BDZE : 1;
			unsigned short MTU7ACZE : 1;
			unsigned short MTU7BDZE : 1;
#endif
	} BIT;
	} POECR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GPT0ABZE : 1;
			unsigned short GPT1ABZE : 1;
			unsigned short GPT2ABZE : 1;
			unsigned short GPT3ABZE : 1;
			unsigned short GPT4ABZE : 1;
			unsigned short GPT5ABZE : 1;
			unsigned short GPT6ABZE : 1;
			unsigned short GPT7ABZE : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short GPT7ABZE : 1;
			unsigned short GPT6ABZE : 1;
			unsigned short GPT5ABZE : 1;
			unsigned short GPT4ABZE : 1;
			unsigned short GPT3ABZE : 1;
			unsigned short GPT2ABZE : 1;
			unsigned short GPT1ABZE : 1;
			unsigned short GPT0ABZE : 1;
#endif
	} BIT;
	} POECR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT34ZE : 1;
			unsigned short IC1ADDMT34ZE : 1;
			unsigned short IC2ADDMT34ZE : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short IC6ADDMT34ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDMT34ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDMT34ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDMT34ZE : 1;
			unsigned short IC5ADDMT34ZE : 1;
			unsigned short IC4ADDMT34ZE : 1;
			unsigned short IC3ADDMT34ZE : 1;
			unsigned short IC2ADDMT34ZE : 1;
			unsigned short IC1ADDMT34ZE : 1;
			unsigned short CMADDMT34ZE : 1;
#endif
	} BIT;
	} POECR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT0ZE : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short IC2ADDMT0ZE : 1;
			unsigned short IC3ADDMT0ZE : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short IC6ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDMT0ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDMT0ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDMT0ZE : 1;
			unsigned short IC5ADDMT0ZE : 1;
			unsigned short IC4ADDMT0ZE : 1;
			unsigned short IC3ADDMT0ZE : 1;
			unsigned short IC2ADDMT0ZE : 1;
			unsigned short IC1ADDMT0ZE : 1;
			unsigned short CMADDMT0ZE : 1;
#endif
	} BIT;
	} POECR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDGPT01ZE : 1;
			unsigned short IC1ADDGPT01ZE : 1;
			unsigned short IC2ADDGPT01ZE : 1;
			unsigned short IC3ADDGPT01ZE : 1;
			unsigned short IC4ADDGPT01ZE : 1;
			unsigned short IC5ADDGPT01ZE : 1;
			unsigned short IC6ADDGPT01ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDGPT01ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDGPT01ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDGPT01ZE : 1;
			unsigned short IC5ADDGPT01ZE : 1;
			unsigned short IC4ADDGPT01ZE : 1;
			unsigned short IC3ADDGPT01ZE : 1;
			unsigned short IC2ADDGPT01ZE : 1;
			unsigned short IC1ADDGPT01ZE : 1;
			unsigned short CMADDGPT01ZE : 1;
#endif
	} BIT;
	} POECR6;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE10M : 4;
			unsigned short POE10M2 : 4;
			unsigned short PIE4 : 1;
			unsigned short POE10E : 1;
			unsigned short  : 2;
			unsigned short POE10F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE10F : 1;
			unsigned short  : 2;
			unsigned short POE10E : 1;
			unsigned short PIE4 : 1;
			unsigned short POE10M2 : 4;
			unsigned short POE10M : 4;
#endif
	} BIT;
	} ICSR4;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE11M : 4;
			unsigned short POE11M2 : 4;
			unsigned short PIE5 : 1;
			unsigned short POE11E : 1;
			unsigned short  : 2;
			unsigned short POE11F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE11F : 1;
			unsigned short  : 2;
			unsigned short POE11E : 1;
			unsigned short PIE5 : 1;
			unsigned short POE11M2 : 4;
			unsigned short POE11M : 4;
#endif
	} BIT;
	} ICSR5;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 9;
			unsigned short OSTSTE : 1;
			unsigned short  : 2;
			unsigned short OSTSTF : 1;
			unsigned short  : 3;
#else
			unsigned short  : 3;
			unsigned short OSTSTF : 1;
			unsigned short  : 2;
			unsigned short OSTSTE : 1;
			unsigned short  : 9;
#endif
	} BIT;
	} ICSR6;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG4A : 1;
			unsigned short OLSG4B : 1;
			unsigned short OLSG5A : 1;
			unsigned short OLSG5B : 1;
			unsigned short OLSG6A : 1;
			unsigned short OLSG6B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG6B : 1;
			unsigned short OLSG6A : 1;
			unsigned short OLSG5B : 1;
			unsigned short OLSG5A : 1;
			unsigned short OLSG4B : 1;
			unsigned short OLSG4A : 1;
#endif
	} BIT;
	} ALR2;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POE12M : 4;
			unsigned short POE12M2 : 4;
			unsigned short PIE7 : 1;
			unsigned short POE12E : 1;
			unsigned short  : 2;
			unsigned short POE12F : 1;
			unsigned short  : 2;
			unsigned short INV : 1;
#else
			unsigned short INV : 1;
			unsigned short  : 2;
			unsigned short POE12F : 1;
			unsigned short  : 2;
			unsigned short POE12E : 1;
			unsigned short PIE7 : 1;
			unsigned short POE12M2 : 4;
			unsigned short POE12M : 4;
#endif
	} BIT;
	} ICSR7;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU9AZE : 1;
			unsigned short MTU9BZE : 1;
			unsigned short MTU9CZE : 1;
			unsigned short MTU9DZE : 1;
			unsigned short  : 12;
#else
			unsigned short  : 12;
			unsigned short MTU9DZE : 1;
			unsigned short MTU9CZE : 1;
			unsigned short MTU9BZE : 1;
			unsigned short MTU9AZE : 1;
#endif
	} BIT;
	} POECR7;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short CMADDMT9ZE : 1;
			unsigned short IC1ADDMT9ZE : 1;
			unsigned short IC2ADDMT9ZE : 1;
			unsigned short IC3ADDMT9ZE : 1;
			unsigned short IC4ADDMT9ZE : 1;
			unsigned short IC5ADDMT9ZE : 1;
			unsigned short IC6ADDMT9ZE : 1;
			unsigned short  : 1;
			unsigned short IC8ADDMT9ZE : 1;
			unsigned short  : 7;
#else
			unsigned short  : 7;
			unsigned short IC8ADDMT9ZE : 1;
			unsigned short  : 1;
			unsigned short IC6ADDMT9ZE : 1;
			unsigned short IC5ADDMT9ZE : 1;
			unsigned short IC4ADDMT9ZE : 1;
			unsigned short IC3ADDMT9ZE : 1;
			unsigned short IC2ADDMT9ZE : 1;
			unsigned short IC1ADDMT9ZE : 1;
			unsigned short CMADDMT9ZE : 1;
#endif
	} BIT;
	} POECR8;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short C0FLAG : 1;
			unsigned short C1FLAG : 1;
			unsigned short C2FLAG : 1;
			unsigned short C3FLAG : 1;
			unsigned short C4FLAG : 1;
			unsigned short C5FLAG : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short C5FLAG : 1;
			unsigned short C4FLAG : 1;
			unsigned short C3FLAG : 1;
			unsigned short C2FLAG : 1;
			unsigned short C1FLAG : 1;
			unsigned short C0FLAG : 1;
#endif
	} BIT;
	} POECMPFR;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short POEREQ0 : 1;
			unsigned short POEREQ1 : 1;
			unsigned short POEREQ2 : 1;
			unsigned short POEREQ3 : 1;
			unsigned short POEREQ4 : 1;
			unsigned short POEREQ5 : 1;
			unsigned short  : 10;
#else
			unsigned short  : 10;
			unsigned short POEREQ5 : 1;
			unsigned short POEREQ4 : 1;
			unsigned short POEREQ3 : 1;
			unsigned short POEREQ2 : 1;
			unsigned short POEREQ1 : 1;
			unsigned short POEREQ0 : 1;
#endif
	} BIT;
	} POECMPSEL;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short  : 8;
			unsigned short OIE3 : 1;
			unsigned short OCE3 : 1;
			unsigned short  : 5;
			unsigned short OSF3 : 1;
#else
			unsigned short OSF3 : 1;
			unsigned short  : 5;
			unsigned short OCE3 : 1;
			unsigned short OIE3 : 1;
			unsigned short  : 8;
#endif
	} BIT;
	} OCSR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short OLSG0A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG2B : 1;
			unsigned short  : 1;
			unsigned short OLSEN : 1;
			unsigned short  : 8;
#else
			unsigned short  : 8;
			unsigned short OLSEN : 1;
			unsigned short  : 1;
			unsigned short OLSG2B : 1;
			unsigned short OLSG2A : 1;
			unsigned short OLSG1B : 1;
			unsigned short OLSG1A : 1;
			unsigned short OLSG0B : 1;
			unsigned short OLSG0A : 1;
#endif
	} BIT;
	} ALR3;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTUCH34HIZ : 1;
			unsigned short MTUCH67HIZ : 1;
			unsigned short MTUCH0HIZ : 1;
			unsigned short GPT01HIZ : 1;
			unsigned short GPT23HIZ : 1;
			unsigned short  : 1;
			unsigned short MTUCH9HIZ : 1;
			unsigned short  : 1;
			unsigned short GPT02HIZ : 1;
			unsigned short GPT46HIZ : 1;
			unsigned short GPT79HIZ : 1;
			unsigned short  : 5;
#else
			unsigned short  : 5;
			unsigned short GPT79HIZ : 1;
			unsigned short GPT46HIZ : 1;
			unsigned short GPT02HIZ : 1;
			unsigned short  : 1;
			unsigned short MTUCH9HIZ : 1;
			unsigned short  : 1;
			unsigned short GPT23HIZ : 1;
			unsigned short GPT01HIZ : 1;
			unsigned short MTUCH0HIZ : 1;
			unsigned short MTUCH67HIZ : 1;
			unsigned short MTUCH34HIZ : 1;
#endif
	} BIT;
	} SPOER;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU0AME : 1;
			unsigned short MTU0BME : 1;
			unsigned short MTU0CME : 1;
			unsigned short MTU0DME : 1;
			unsigned short  : 4;
			unsigned short MTU9AME : 1;
			unsigned short MTU9BME : 1;
			unsigned short MTU9CME : 1;
			unsigned short MTU9DME : 1;
			unsigned short  : 4;
#else
			unsigned short  : 4;
			unsigned short MTU9DME : 1;
			unsigned short MTU9CME : 1;
			unsigned short MTU9BME : 1;
			unsigned short MTU9AME : 1;
			unsigned short  : 4;
			unsigned short MTU0DME : 1;
			unsigned short MTU0CME : 1;
			unsigned short MTU0BME : 1;
			unsigned short MTU0AME : 1;
#endif
	} BIT;
	} PMMCR0;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short MTU7BME : 1;
			unsigned short MTU7AME : 1;
			unsigned short MTU6BME : 1;
			unsigned short MTU7DME : 1;
			unsigned short MTU7CME : 1;
			unsigned short MTU6DME : 1;
			unsigned short  : 2;
			unsigned short MTU4BME : 1;
			unsigned short MTU4AME : 1;
			unsigned short MTU3BME : 1;
			unsigned short MTU4DME : 1;
			unsigned short MTU4CME : 1;
			unsigned short MTU3DME : 1;
			unsigned short  : 2;
#else
			unsigned short  : 2;
			unsigned short MTU3DME : 1;
			unsigned short MTU4CME : 1;
			unsigned short MTU4DME : 1;
			unsigned short MTU3BME : 1;
			unsigned short MTU4AME : 1;
			unsigned short MTU4BME : 1;
			unsigned short  : 2;
			unsigned short MTU6DME : 1;
			unsigned short MTU7CME : 1;
			unsigned short MTU7DME : 1;
			unsigned short MTU6BME : 1;
			unsigned short MTU7AME : 1;
			unsigned short MTU7BME : 1;
#endif
	} BIT;
	} PMMCR1;
	union {
		unsigned short WORD;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned short GPT0AME : 1;
			unsigned short GPT0BME : 1;
			unsigned short GPT1AME : 1;
			unsigned short GPT1BME : 1;
			unsigned short GPT2AME : 1;
			unsigned short GPT2BME : 1;
			unsigned short GPT3AME : 1;
			unsigned short GPT3BME : 1;
			unsigned short GPT4AME : 1;
			unsigned short GPT4BME : 1;
			unsigned short GPT5AME : 1;
			unsigned short GPT5BME : 1;
			unsigned short GPT6AME : 1;
			unsigned short GPT6BME : 1;
			unsigned short GPT7AME : 1;
			unsigned short GPT7BME : 1;
#else
			unsigned short GPT7BME : 1;
			unsigned short GPT7AME : 1;
			unsigned short GPT6BME : 1;
			unsigned short GPT6AME : 1;
			unsigned short GPT5BME : 1;
			unsigned short GPT5AME : 1;
			unsigned short GPT4BME : 1;
			unsigned short GPT4AME : 1;
			unsigned short GPT3BME : 1;
			unsigned short GPT3AME : 1;
			unsigned short GPT2BME : 1;
			unsigned short GPT2AME : 1;
			unsigned short GPT1BME : 1;
			unsigned short GPT1AME : 1;
			unsigned short GPT0BME : 1;
			unsigned short GPT0AME : 1;
#endif
	} BIT;
	} PMMCR2;
	char           wk1[2];
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX0;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX1;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX2;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX3;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX4;
	union {
		unsigned char BYTE;
		struct {
			
#ifdef __RX_LITTLE_ENDIAN__
			unsigned char POEREQ0 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ5 : 1;
			unsigned char  : 2;
#else
			unsigned char  : 2;
			unsigned char POEREQ5 : 1;
			unsigned char POEREQ4 : 1;
			unsigned char POEREQ3 : 1;
			unsigned char POEREQ2 : 1;
			unsigned char POEREQ1 : 1;
			unsigned char POEREQ0 : 1;
#endif
	} BIT;
	} POECMPEX5;
	char           wk2[2];
	union {
		unsigned short WORD;
		struct {
			
